Diplom-Project/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОтветственныйСотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ФайлКартинкиЛоготип</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ФайлКартинкиПечать</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ФайлКартинкиПодпись</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Diplom-Project/src/Catalogs/Организации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//ВКМ_Захарова: Получить структуру (УправлениеПечатьюПереопределяемый.ПриПолученииПодписейИПечатей)

Функция ПолучитьПодписиИПечати(Организация) Экспорт 
//ВКМ_Захарова: Получить структуру (УправлениеПечатьюПереопределяемый.ПриПолученииПодписейИПечатей)
	
	НаборКартинок = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.ВКМ_ФайлКартинкиПечать КАК ПечатьОрганизации,
		|	Организации.ВКМ_ФайлКартинкиПодпись КАК ПодписьРуководителя
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		КартинкаПечать = КартинкаИзФайла(Выборка.ПечатьОрганизации);
		НаборКартинок.Вставить("ПечатьОрганизации", КартинкаПечать);
		
		КартинкаПодпись = КартинкаИзФайла(Выборка.ПодписьРуководителя);
		НаборКартинок.Вставить("ПодписьРуководителя", КартинкаПодпись);
		
	Иначе
		
		НаборКартинок.Вставить("ПечатьОрганизации", Новый Картинка);
		НаборКартинок.Вставить("ПодписьРуководителя", Новый Картинка);
		
	КонецЕсли;
	
	Возврат НаборКартинок;
	
//ВКМ_Захарова
КонецФункции

//ВКМ_Захарова
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//ВКМ_Захарова: Получить картинку подписи и печати

Функция КартинкаИзФайла(Файл)
//ВКМ_Захарова: Получить картинку подписи и печати
	
	ДвоичныеДанные = Неопределено;
	
	Если ЗначениеЗаполнено(Файл) Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Файл, Ложь);
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Новый Картинка;
	КонецЕсли;
	
	Возврат Новый Картинка(ДвоичныеДанные, Истина);
	
//ВКМ_Захарова
КонецФункции

//ВКМ_Захарова
#КонецОбласти

#КонецЕсли
